; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-82)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 l15 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c1)
    (capacity v4 c2)
    (capacity v5 c2)
    (capacity v6 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l14)
    (at p2 l15)
    (at p3 l14)
    (at p4 l1)
    (at p5 l7)
    (at p6 l9)
    (at p7 l9)
    (at p8 l6)
    (at p9 l6)
    (at p10 l14)
    (at p11 l1)
    (at p12 l3)
    (at p13 l3)
    (at p14 l6)
    (at v1 l9)
    (at v2 l6)
    (at v3 l12)
    (at v4 l4)
    (at v5 l3)
    (at v6 l1)
    (road l12 l4)
    (road l12 l7)
    (road l3 l4)
    (road l4 l3)
    (road l14 l1)
    (road l5 l4)
    (road l4 l12)
    (road l9 l5)
    (road l8 l9)
    (road l9 l8)
    (road l8 l6)
    (road l10 l9)
    (road l9 l11)
    (road l6 l8)
    (road l4 l2)
    (road l4 l5)
    (road l5 l9)
    (road l9 l10)
    (road l2 l4)
    (road l1 l8)
    (road l1 l14)
    (road l15 l13)
    (road l6 l13)
    (road l7 l12)
    (road l8 l1)
    (road l11 l9)
    (road l13 l6)
    (road l13 l15)
    (road l4 l6)
    (road l6 l4)
    (road l2 l8)
    (road l8 l2)
    (road l1 l10)
    (road l10 l1)
    (road l8 l13)
    (road l13 l8)
    (road l2 l9)
    (road l9 l2)
    (road l9 l14)
    (road l14 l9)
    (road l10 l13)
    (road l13 l10)
    (road l10 l14)
    (road l14 l10)
    (road l3 l8)
    (road l8 l3)
    (road l6 l14)
    (road l14 l6)
    (road l10 l12)
    (road l12 l10)
    (road l14 l15)
    (road l15 l14)
    (road l2 l11)
    (road l11 l2)
    (road l6 l9)
    (road l9 l6)
    (road l2 l7)
    (road l7 l2)
    (road l5 l14)
    (road l14 l5)
    (road l1 l4)
    (road l4 l1)
    (road l5 l6)
    (road l6 l5)
    (road l9 l13)
    (road l13 l9)
    (road l2 l12)
    (road l12 l2)
    (road l2 l5)
    (road l5 l2)
    (road l5 l7)
    (road l7 l5)
    (road l6 l12)
    (road l12 l6)
    (road l6 l15)
    (road l15 l6)
    (road l1 l11)
    (road l11 l1)
    (road l4 l13)
    (road l13 l4)
    (road l1 l9)
    (road l9 l1)
    (road l4 l10)
    (road l10 l4)
    (road l12 l13)
    (road l13 l12)
    (road l7 l13)
    (road l13 l7)
    (road l6 l11)
    (road l11 l6)
    (road l7 l9)
    (road l9 l7)
    (road l7 l8)
    (road l8 l7)
    (road l3 l9)
    (road l9 l3)
    (road l4 l9)
    (road l9 l4)
    (road l7 l11)
    (road l11 l7)
    (road l1 l15)
    (road l15 l1)
    (road l3 l11)
    (road l11 l3)
    (road l8 l12)
    (road l12 l8)
    (road l5 l11)
    (road l11 l5)
    (road l9 l12)
    (road l12 l9)
    (road l3 l12)
    (road l12 l3)
    (road l2 l10)
    (road l10 l2)
    (road l5 l15)
    (road l15 l5)
    (road l1 l5)
    (road l5 l1)
    (road l3 l13)
    (road l13 l3)
    (road l3 l15)
    (road l15 l3)
    (road l3 l6)
    (road l6 l3)
    (road l2 l6)
    (road l6 l2)
    (road l2 l14)
    (road l14 l2)
    (road l1 l2)
    (road l2 l1)
    (road l8 l14)
    (road l14 l8)
    (road l11 l15)
    (road l15 l11)
    (road l1 l7)
    (road l7 l1)
    (road l4 l8)
    (road l8 l4)
    (road l2 l3)
    (road l3 l2)
    (road l11 l14)
    (road l14 l11)
    (road l12 l14)
    (road l14 l12)
    (road l5 l12)
    (road l12 l5)
    (road l4 l7)
    (road l7 l4)
    (road l3 l5)
    (road l5 l3)
    )
 (:goal (and 
(at p1 l8)
(at p2 l1)
(at p3 l13)
(at p4 l9)
(at p5 l6)
(at p6 l7)
(at p7 l6)
(at p8 l1)
))
)

; plan
1. (pick-up v2 l6 p8 c1 c2)
   deleted: (at p8 l6) (capacity v2 c2)
   added: (in p8 v2) (capacity v2 c1)
   goals met: 0 of 8
2. (drive v2 l6 l15)
   deleted: (at v2 l6)
   added: (at v2 l15)
   goals met: 0 of 8
3. (pick-up v2 l15 p2 c0 c1)
   deleted: (at p2 l15) (capacity v2 c1)
   added: (in p2 v2) (capacity v2 c0)
   goals met: 0 of 8
4. (drive v2 l15 l1)
   deleted: (at v2 l15)
   added: (at v2 l1)
   goals met: 0 of 8
5. (drop v2 l1 p2 c0 c1)
   deleted: (in p2 v2) (capacity v2 c0)
   added: (at p2 l1) (capacity v2 c1)
   goals met: 1 of 8
6. (drop v2 l1 p8 c1 c2)
   deleted: (in p8 v2) (capacity v2 c1)
   added: (at p8 l1) (capacity v2 c2)
   goals met: 2 of 8
7. (pick-up v2 l1 p4 c1 c2)
   deleted: (at p4 l1) (capacity v2 c2)
   added: (in p4 v2) (capacity v2 c1)
   goals met: 2 of 8
8. (drive v2 l1 l9)
   deleted: (at v2 l1)
   added: (at v2 l9)
   goals met: 2 of 8
9. (drop v2 l9 p4 c1 c2)
   deleted: (in p4 v2) (capacity v2 c1)
   added: (at p4 l9) (capacity v2 c2)
   goals met: 3 of 8
10. (pick-up v2 l9 p7 c1 c2)
   deleted: (at p7 l9) (capacity v2 c2)
   added: (in p7 v2) (capacity v2 c1)
   goals met: 3 of 8
11. (pick-up v2 l9 p6 c0 c1)
   deleted: (at p6 l9) (capacity v2 c1)
   added: (in p6 v2) (capacity v2 c0)
   goals met: 3 of 8
12. (drive v2 l9 l7)
   deleted: (at v2 l9)
   added: (at v2 l7)
   goals met: 3 of 8
13. (drop v2 l7 p6 c0 c1)
   deleted: (in p6 v2) (capacity v2 c0)
   added: (at p6 l7) (capacity v2 c1)
   goals met: 4 of 8
14. (pick-up v2 l7 p5 c0 c1)
   deleted: (at p5 l7) (capacity v2 c1)
   added: (in p5 v2) (capacity v2 c0)
   goals met: 4 of 8
15. (drive v2 l7 l11)
   deleted: (at v2 l7)
   added: (at v2 l11)
   goals met: 4 of 8
16. (drive v2 l11 l6)
   deleted: (at v2 l11)
   added: (at v2 l6)
   goals met: 4 of 8
17. (drop v2 l6 p5 c0 c1)
   deleted: (in p5 v2) (capacity v2 c0)
   added: (at p5 l6) (capacity v2 c1)
   goals met: 5 of 8
18. (drop v2 l6 p7 c1 c2)
   deleted: (in p7 v2) (capacity v2 c1)
   added: (at p7 l6) (capacity v2 c2)
   goals met: 6 of 8
19. (drive v2 l6 l14)
   deleted: (at v2 l6)
   added: (at v2 l14)
   goals met: 6 of 8
20. (pick-up v2 l14 p1 c1 c2)
   deleted: (at p1 l14) (capacity v2 c2)
   added: (in p1 v2) (capacity v2 c1)
   goals met: 6 of 8
21. (pick-up v2 l14 p3 c0 c1)
   deleted: (at p3 l14) (capacity v2 c1)
   added: (in p3 v2) (capacity v2 c0)
   goals met: 6 of 8
22. (drive v2 l14 l8)
   deleted: (at v2 l14)
   added: (at v2 l8)
   goals met: 6 of 8
23. (drop v2 l8 p1 c0 c1)
   deleted: (in p1 v2) (capacity v2 c0)
   added: (at p1 l8) (capacity v2 c1)
   goals met: 7 of 8
24. (drive v2 l8 l13)
   deleted: (at v2 l8)
   added: (at v2 l13)
   goals met: 7 of 8
25. (drop v2 l13 p3 c1 c2)
   deleted: (in p3 v2) (capacity v2 c1)
   added: (at p3 l13) (capacity v2 c2)
   goals met: 8 of 8
